/*2453359 李欣洋 信安*/
#include <iostream>
#include <Windows.h>
#include <math.h>
#include "../include/cmd_hdc_tools.h"
using namespace std;

#define Pi 3.14159

// ========== 颜色定义 ==========
#define COLOR_SEAL_BLUE RGB(173, 203, 227)      // 海豹身体蓝色
#define COLOR_SEAL_WHITE RGB(255, 255, 255)     // 海豹肚子白色
#define COLOR_BLUSH_PINK RGB(255, 192, 203)     // 脸颊粉色
#define COLOR_MOUTH_PINK RGB(255, 150, 150)     // 嘴巴粉色
//#define COLOR_BLACK RGB(52, 73, 85)             // 描边黑色
#define COLOR_FISH_ORANGE RGB(255, 179, 120)    // 鱼的橙色
#define COLOR_STICK_BROWN RGB(139, 115, 85)     // 木棍棕色

/***************************************************************************
  函数名称：fill_polygon
  功    能：填充任意多边形（凸多边形或凹多边形）
  输入参数：const int* x_points    ：多边形各顶点的x坐标数组
            const int* y_points    ：多边形各顶点的y坐标数组
            const int num_points   ：顶点数量（至少3个）
            const int RGB_value    ：填充颜色
  返 回 值：无
  说    明：使用扫描线填充算法
***************************************************************************/
template<size_t T>
static void fill_polygon(int (&point)[T][2], const int mid_x, const int mid_y, const int RGB_value)
{
    for (size_t i = 0; i < T; i++) {
        int x1 = point[i][0];
        int y1 = point[i][1];

        int x2 = point[(i + 1) % T][0];
        int y2 = point[(i + 1) % T][1];

        hdc_triangle(mid_x, mid_y, x1, y1, x2, y2, true, 1, RGB_value);
    }
}

/***************************************************************************
  函数名称：fill_polygon
  功    能：填充任意多边形（凸多边形或凹多边形）
  输入参数：const int* x_points    ：多边形各顶点的x坐标数组
            const int* y_points    ：多边形各顶点的y坐标数组
            const int num_points   ：顶点数量（至少3个）
            const int RGB_value    ：填充颜色
  返 回 值：无
  说    明：使用扫描线填充算法
***************************************************************************/
template<size_t T>
static void fill_arc(int(&point)[T][2], const int mid_x, const int mid_y, const int RGB_value)
{
    for (size_t i = 0; i < T; i++) {
        int x1 = point[i][0];
        int y1 = point[i][1];

        int x2 = point[(i + 1) % T][0];
        int y2 = point[(i + 1) % T][1];

        hdc_triangle(mid_x, mid_y, x1, y1, x2, y2, true, 1, RGB_value);
    }
}

/***************************************************************************
  函数名称: connect_points_with_arc
  功    能: 按顺序连接一组点
  输入参数:int(&point)[T][2]  : 点坐标数组
            const int thinkness : 线宽
            const int RGB_value : 颜色
           
  返 回 值:无
  说    明: 
***************************************************************************/
template <size_t T>
static void connect_points_with_arc(int(&point)[T][2], const int thinkness, const int RGB_value)
{
    if (T < 3) return; // 至少3个点才能拟合圆弧

    for (size_t i = 0; i < T - 2; i++) {
        int x1 = point[i][0];
        int y1 = point[i][1];
        int x2 = point[i + 1][0];
        int y2 = point[i + 1][1];
        hdc_line(x1, y1, x2, y2, thinkness, RGB_value);
    }
}
void hdc_draw_cartoon_2453359(const int base_x, const int base_y)
{
    hdc_cls();
    int x = base_x;
    int y = base_y;
    hdc_rectangle(0, 0, 1500, 1500, 0, 1, 2,COLOR_SEAL_WHITE);
    hdc_line(30, 774, 1004, 776, 50, COLOR_BLACK);
    int point[][2] = {
    x - 255, y + 135,
    x - 255, y + 126,
    x - 256, y + 117,
    x - 256, y + 108,
    x - 256, y + 100,
    x - 256, y + 95,
    x - 256, y + 85,
    x - 256, y + 81,
    x - 253, y + 72,
    x - 250, y + 64,
    x - 245, y + 54,
    x - 243, y + 47,
    x - 241, y + 41,
    x - 236, y + 33,
    x - 230, y + 23,
    x - 226, y + 16,
    x - 222, y + 10,
    x - 216, y + 3,
    x - 209, y - 1,
    x - 203, y - 6,
    x - 196, y - 10,
    x - 190, y - 14,
    x - 185, y - 19,
    x - 180, y - 22,
    x - 179, y - 30,
    x - 179, y - 36,
    x - 179, y - 41,
    x - 177, y - 47,
    x - 176, y - 52,
    x - 176, y - 59,
    x - 173, y - 64,
    x - 171, y - 70,
    x - 169, y - 79,
    x - 168, y - 85,
    x - 164, y - 94,
    x - 160, y - 101,
    x - 159, y - 111,
    x - 155, y - 115,
    x - 151, y - 125,
    x - 149, y - 130,
    x - 143, y - 136,
    x - 137, y - 146,
    x - 132, y - 154,
    x - 124, y - 162,
    x - 115, y - 168,
    x - 108, y - 173,
    x - 98, y - 182,
    x - 91, y - 186,
    x - 82, y - 192,
    x - 71, y - 198,
    x - 65, y - 203,
    x - 57, y - 203,
    x - 44, y - 207,
    x - 32, y - 213,
    x - 17, y - 218,
    x - 7, y - 221,
    x + 1, y - 225,
    x + 10, y - 227,
    x + 16, y - 227,
    x + 24, y - 232,
    x + 30, y - 232,
    x + 33, y - 236,
    x + 40, y - 238,
    x + 48, y - 238,
    x + 60, y - 240,
    x + 71, y - 242,
    x + 77, y - 244,
    x + 84, y - 244,
    x + 93, y - 246,
    x + 97, y - 245,
    x + 103, y - 245,
    x + 106, y - 245,
    x + 108, y - 245,
    x + 114, y - 245,
    x + 117, y - 245,
    x + 119, y - 245,
    x + 123, y - 244,
    x + 130, y - 244,
    x + 134, y - 244,
    x + 137, y - 244,
    x + 145, y - 244,
    x + 149, y - 241,
    x + 154, y - 240,
    x + 158, y - 240,
    x + 164, y - 240,
    x + 170, y - 240,
    x + 176, y - 240,
    x + 180, y - 240,
    x + 185, y - 239,
    x + 191, y - 239,
    x + 195, y - 239,
    x + 202, y - 239,
    x + 210, y - 238,
    x + 219, y - 237,
    x + 229, y - 234,
    x + 244, y - 231,
    x + 256, y - 227,
    x + 268, y - 222,
    x + 281, y - 217,
    x + 292, y - 210,
    x + 303, y - 208,
    x + 322, y - 203,
    x + 332, y - 197,
    x + 344, y - 191,
    x + 354, y - 185,
    x + 371, y - 171,
    x + 379, y - 165,
    x + 387, y - 153,
    x + 398, y - 143,
    x + 410, y - 132,
    x + 420, y - 119,
    x + 425, y - 113,
    x + 439, y - 96,
    x + 455, y - 84,
    x + 466, y - 76,
    x + 475, y - 70,
    x + 487, y - 61,
    x + 496, y - 54,
    x + 503, y - 46,
    x + 512, y - 36,
    x + 523, y - 25,
    x + 534, y - 10,
    x + 541, y + 3,
    x + 549, y + 17,
    x + 558, y + 35,
    x + 568, y + 54,
    x + 577, y + 69,
    x + 584, y + 91,
    x + 583, y + 106,
    x + 582, y + 131,
    x + 577, y + 149,
    x + 570, y + 162,
    x + 560, y + 176,
    x + 545, y + 188,
    x + 526, y + 196,
    x + 518, y + 208,
    x + 508, y + 215,
    x + 243, y + 56,
    x + 224, y + 47,
    x + 199, y + 38,
    x + 183, y + 31,
    x + 161, y + 22,
    x + 133, y + 19,
    x + 116, y + 20,
    x + 94, y + 20,
    x + 72, y + 19,
    x + 53, y + 21,
    x + 41, y + 21,
    x + 21, y + 21,
    x - 3, y + 21,
    x - 20, y + 23,
    x - 36, y + 26,
    x - 46, y + 28,
    x - 65, y + 32,
    x - 82, y + 33,
    x - 93, y + 35,
    x - 109, y + 43,
    x - 123, y + 48,
    x - 133, y + 56,
    x - 150, y + 67,
    x - 166, y + 84,
    x - 178, y + 95,
    x - 188, y + 100,
    x - 196, y + 117,
    x - 203, y + 130,
    x - 207, y + 136,
    x - 231, y + 137,
    x - 255, y + 135
    };

    int point_1[][2] = {
        x + 420, y + 369,
        x + 412, y + 376,
        x + 408, y + 385,
        x + 401, y + 392,
        x + 387, y + 404,
        x + 372, y + 417,
        x + 354, y + 430,
        x + 331, y + 436,
        x + 310, y + 442,
        x + 294, y + 444,
        x + 283, y + 447,
        x + 260, y + 448,
        x + 237, y + 439,
        x + 223, y + 435,
        x + 211, y + 426,
        x + 204, y + 415,
        x + 197, y + 407,
        x + 192, y + 394,
        x + 189, y + 382,
        x + 193, y + 363,
        x + 202, y + 351,
        x + 205, y + 353,
        x + 211, y + 336,
        x + 228, y + 324,
        x + 240, y + 317,
        x + 250, y + 310,
        x + 256, y + 308,
        x + 284, y + 306,
        x + 301, y + 302,
        x + 316, y + 294,
        x + 327, y + 290,
        x + 336, y + 282,
        x + 346, y + 267,
        x + 351, y + 252
    };

    int point_2[][2] = {
        x + 493, y + 220,
        x + 495, y + 235,
        x + 495, y + 244,
        x + 495, y + 255,
        x + 495, y + 263,
        x + 495, y + 273,
        x + 495, y + 289,
        x + 496, y + 301,
        x + 496, y + 313,
        x + 496, y + 327,
        x + 496, y + 324,
        x + 496, y + 355,
        x + 496, y + 374,
        x + 487, y + 379,
        x + 465, y + 384,
        x + 451, y + 387,
        x + 436, y + 368,
        x + 428, y + 376,
        x + 351, y + 243,
        x + 352, y + 223,
        x + 353, y + 212,
        x + 351, y + 200,
        x + 349, y + 188,
        x + 345, y + 179,
        x + 339, y + 169,
        x + 331, y + 154,
        x + 327, y + 143,
        x + 322, y + 135,
        x + 317, y + 126,
        x + 310, y + 117,
        x + 302, y + 108,
        x + 290, y + 96,
        x + 279, y + 84,
        x + 268, y + 73,
        x + 253, y + 62
    };

    int point_3[][2] = {
        x - 242, y + 145,
        x - 203, y + 150,
        x - 174, y + 166,
        x - 149, y + 185,
        x - 134, y + 209,
        x - 123, y + 238,
        x - 120, y + 268,
        x - 117, y + 303,
        x - 114, y + 337,
        x - 124, y + 363,
        x - 142, y + 385,
        x - 161, y + 399,
        x - 177, y + 409,
        x - 195, y + 416,
        x - 216, y + 416,
        x - 239, y + 410,
        x - 254, y + 395,
        x - 262, y + 382,
        x - 259, y + 362,
        x - 258, y + 348,
        x - 260, y + 330,
        x - 263, y + 311,
        x - 269, y + 295,
        x - 276, y + 272,
        x - 286, y + 250,
        x - 288, y + 226,
        x - 286, y + 250,
        x - 288, y + 226,
        x - 286, y + 205,
        x - 276, y + 175,
        x - 265, y + 157,
        x - 247, y + 147,
        x - 242, y + 145
    };

    int point_4[][2] = {
        x - 255, y + 135,
        x - 255, y + 126,
        x - 256, y + 117,
        x - 256, y + 108,
        x - 256, y + 100,
        x - 256, y + 95,
        x - 256, y + 85,
        x - 256, y + 81,
        x - 253, y + 72,
        x - 250, y + 64,
        x - 245, y + 54,
        x - 243, y + 47,
        x - 241, y + 41,
        x - 236, y + 33,
        x - 230, y + 23,
        x - 226, y + 16,
        x - 222, y + 10,
        x - 216, y + 3,
        x - 209, y - 1,
        x - 203, y - 6,
        x - 196, y - 10,
        x - 190, y - 14,
        x - 185, y - 19,
        x - 180, y - 22,
        x - 179, y - 30,
        x - 179, y - 36,
        x - 179, y - 41,
        x - 177, y - 47,
        x - 176, y - 52,
        x - 176, y - 59,
        x - 173, y - 64,
        x - 171, y - 70,
        x - 169, y - 79,
        x - 168, y - 85,
        x - 164, y - 94,
        x - 160, y - 101,
        x - 159, y - 111,
        x - 155, y - 115,
        x - 151, y - 125,
        x - 149, y - 130,
        x - 143, y - 136,
        x - 137, y - 146,
        x - 132, y - 154,
        x - 124, y - 162,
        x - 115, y - 168,
        x - 108, y - 173,
        x - 98, y - 182,
        x - 91, y - 186,
        x - 82, y - 192,
        x - 71, y - 198,
        x - 65, y - 203,
        x - 57, y - 203,
        x - 44, y - 207,
        x - 32, y - 213,
        x - 17, y - 218,
        x - 7, y - 221,
        x + 1, y - 225,
        x + 10, y - 227,
        x + 16, y - 227,
        x + 24, y - 232,
        x + 30, y - 232,
        x + 33, y - 236,
        x + 40, y - 238,
        x + 48, y - 238,
        x + 60, y - 240,
        x + 71, y - 242,
        x + 77, y - 244,
        x + 84, y - 244,
        x + 93, y - 246,
        x + 97, y - 245,
        x + 103, y - 245,
        x + 106, y - 245,
        x + 108, y - 245,
        x + 114, y - 245,
        x + 117, y - 245,
        x + 119, y - 245,
        x + 123, y - 244,
        x + 130, y - 244,
        x + 134, y - 244,
        x + 137, y - 244,
        x + 145, y - 244,
        x + 149, y - 241,
        x + 154, y - 240,
        x + 158, y - 240,
        x + 164, y - 240,
        x + 170, y - 240,
        x + 176, y - 240,
        x + 180, y - 240,
        x + 185, y - 239,
        x + 191, y - 239,
        x + 195, y - 239,
        x + 202, y - 239,
        x + 210, y - 238,
        x + 219, y - 237,
        x + 229, y - 234,
        x + 244, y - 231,
        x + 256, y - 227,
        x + 268, y - 222,
        x + 281, y - 217,
        x + 292, y - 210,
        x + 303, y - 208,
        x + 322, y - 203,
        x + 332, y - 197,
        x + 344, y - 191,
        x + 354, y - 185,
        x + 371, y - 171,
        x + 379, y - 165,
        x + 387, y - 153,
        x + 398, y - 143,
        x + 410, y - 132,
        x + 420, y - 119,
        x + 425, y - 113,
        x + 439, y - 96,
        x + 455, y - 84,
        x + 466, y - 76,
        x + 475, y - 70,
        x + 487, y - 61,
        x + 496, y - 54,
        x + 503, y - 46,
        x + 512, y - 36,
        x + 523, y - 25,
        x + 534, y - 10,
        x + 541, y + 3,
        x + 549, y + 17,
        x + 558, y + 35,
        x + 568, y + 54,
        x + 577, y + 69,
        x + 584, y + 91,
        x + 583, y + 106,
        x + 582, y + 131,
        x + 577, y + 149,
        x + 570, y + 162,
        x + 560, y + 176,
        x + 545, y + 188,
        x + 526, y + 196,
        x + 518, y + 208,
        x + 508, y + 215
    };

    int point_5[][2] = {
        x + 493, y + 220,
        x + 495, y + 235,
        x + 495, y + 244,
        x + 495, y + 255,
        x + 495, y + 263,
        x + 495, y + 273,
        x + 495, y + 289,
        x + 496, y + 301,
        x + 496, y + 313,
        x + 496, y + 327,
        x + 496, y + 324,
        x + 496, y + 355,
        x + 496, y + 374,
        x + 487, y + 379,
        x + 465, y + 384,
        x + 451, y + 387,
        x + 436, y + 368,
        x + 428, y + 376
    };

    int point_eye[][2] = {
        x - 128, y - 42,
        x - 115, y - 35,
        x - 111, y - 26,
        x - 105, y - 11,
        x - 109, y + 2,
        x - 115, y + 19,
        x - 122, y + 17,
        x - 133, y + 21,
        x - 142, y + 14,
        x - 146, y + 1,
        x - 145, y - 10,
        x - 144, y - 19,
        x - 140, y - 29,
        x - 137, y - 37,
        x - 129, y - 42
    };

    int point_teeth[][2] = {
        x - 52, y + 41,
        x - 36, y + 50,
        x - 18, y + 63,
        x - 12, y + 63,
        x - 6, y + 57,
        x - 5, y + 50,
        x + 2, y + 40,
        x + 9, y + 35,
        x + 14, y + 32,
        x + 22, y + 33,
        x + 27, y + 36,
        x + 36, y + 51,
        x + 49, y + 56,
        x + 60, y + 59,
        x + 68, y + 59,
        x + 78, y + 47,
        x + 83, y + 41,
        x + 89, y + 33,
        x + 93, y + 32,
        x + 97, y + 43,
        x + 102, y + 49,
        x + 106, y + 59,
        x + 112, y + 66,
        x + 118, y + 73,
        x + 123, y + 74,
        x + 130, y + 70,
        x + 137, y + 64,
        x + 145, y + 55,
        x + 149, y + 49,
        x + 161, y + 60,
        x + 166, y + 66,
        x + 174, y + 74,
        x + 182, y + 84,
        x + 182, y + 95,
        x + 180, y + 103,
        x + 173, y + 113,
        x + 168, y + 125,
        x + 164, y + 137,
        x + 161, y + 149,
        x + 160, y + 159,
        x + 148, y + 163,
        x + 137, y + 161,
        x + 128, y + 151,
        x + 118, y + 141,
        x + 106, y + 135,
        x + 91, y + 129,
        x + 76, y + 128,
        x + 54, y + 125,
        x + 38, y + 122,
        x + 23, y + 122,
        x - 1, y + 121,
        x - 19, y + 120,
        x - 39, y + 118,
        x - 56, y + 110,
        x - 66, y + 103,
        x - 70, y + 93,
        x - 73, y + 84,
        x - 77, y + 72,
        x - 72, y + 61,
        x - 70, y + 53,
        x - 61, y + 49,
        x - 52, y + 41
    };

    int point_teeth_2[][2] = {
        x - 52, y + 41,
        x - 26, y + 34,
        x - 14, y + 32,
        x - 1, y + 30,
        x + 14, y + 32,
        x + 29, y + 26,
        x + 43, y + 23,
        x + 57, y + 22,
        x + 73, y + 22,
        x + 93, y + 32,
        x + 109, y + 32,
        x + 121, y + 35,
        x + 135, y + 40,
        x + 149, y + 49,
        x + 151, y + 48,
        x + 152, y + 47
    };

    int point_teeth_3[][2] = {
        x + 149, y + 49,
        x + 161, y + 60,
        x + 166, y + 66,
        x + 174, y + 74,
        x + 182, y + 84,
        x + 182, y + 95,
        x + 180, y + 103,
        x + 173, y + 113,
        x + 168, y + 125,
        x + 164, y + 137,
        x + 161, y + 149,
        x + 160, y + 159,
        x + 148, y + 163,
        x + 137, y + 161,
        x + 128, y + 151,
        x + 118, y + 141,
        x + 106, y + 135,
        x + 91, y + 129,
        x + 76, y + 128,
        x + 54, y + 125,
        x + 38, y + 122,
        x + 23, y + 122,
        x - 1, y + 121,
        x - 19, y + 120,
        x - 39, y + 118,
        x - 56, y + 110,
        x - 66, y + 103,
        x - 70, y + 93,
        x - 73, y + 84,
        x - 77, y + 72,
        x - 72, y + 61,
        x - 70, y + 53,
        x - 61, y + 49,
        x - 52, y + 41
    };

    int point_6[][2] = {
        x + 453, y - 92,
        x + 462, y - 68,
        x + 468, y - 41,
        x + 476, y - 14,
        x + 482, y + 18,
        x + 484, y + 49,
        x + 487, y + 86,
        x + 491, y + 121,
        x + 493, y + 153,
        x + 492, y + 178,
        x + 493, y + 202,
        x + 493, y + 217
    };
    fill_polygon(point, 514, 294, COLOR_SEAL_BLUE);
    fill_polygon(point_1, 700, 763, COLOR_SEAL_BLUE);
    fill_polygon(point_2, 783, 458, COLOR_SEAL_BLUE);
    fill_polygon(point_3, 195, 671, COLOR_SEAL_BLUE);

    connect_points_with_arc(point_3, 3, COLOR_BLACK);
    connect_points_with_arc(point_4, 3, COLOR_BLACK);
    connect_points_with_arc(point_1, 3, COLOR_BLACK);
    connect_points_with_arc(point_5, 3, COLOR_BLACK);

   // fill_polygon(point_eye, 272, 392, COLOR_BLACK);
    hdc_ellipse(234, 444, 40, 30, 0, 1, 3, COLOR_BLUSH_PINK);
    hdc_ellipse(659, 443, 40, 30, 0, 1, 3, COLOR_BLUSH_PINK);
    hdc_ellipse(272, 392, 18, 28, 0, 1, 3, COLOR_BLACK);
    hdc_ellipse(620, 401, 15, 25, 0, 1, 3, COLOR_BLACK);

    fill_polygon(point_teeth, 453, 456, COLOR_MOUTH_PINK);
    connect_points_with_arc(point_teeth_3, 5, COLOR_BLACK);
    connect_points_with_arc(point_teeth_2, 5, COLOR_BLACK);
    connect_points_with_arc(point_6, 5, COLOR_BLACK);
}
